tests/blockmesh/cube/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       22800;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       23200;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       24400;
    }
)

// ************************************************************************* //
